# Description:
#   呼びかけに「一句」という単語が含まれていたら俳句を詠む

module.exports = (robot) ->

  robot.respond /.*一句/i, (msg) ->
    msg.finish()

    msg.send msg.random kami

    setTimeout () ->
      msg.send msg.random naka
    , 1.5 * 1000

    setTimeout () ->
      msg.send msg.random shimo
    , 3.0 * 1000


kami = [
  "進捗は"
  "進捗を"
  "進捗が"
  "星空に"
  "人として"
  "君までも"
  "今年こそ"
  "現し世の"
  "人生は"
  "ひさかたの"
  "必殺の"
  "Apple の"
  "邪魔するな"
  "いいだろう"
  "やるがいい"
  "相次いで"
  "流れ星"
  "ちょっと待て"
  "朝起きて"
  "有り得ない"
  "おもしろい"
]

naka = [
  "進捗確認"
  "進捗しよう"
  "進捗すれば"
  "私の進捗"
  "涙こらえて"
  "心ゆくまで"
  "一か八かの"
  "右も左も"
  "一瞬止まる"
  "どのみち結局"
  "寝ても覚めても"
  "頭の中だけ"
  "私の俳句"
  "国境越えて"
  "今か今かと"
  "血で血を洗う"
  "枕濡らして"
  "Android は"
  "お願いだから"
  "熱い血潮の"
  "プラス思考の"
  "愚痴は言わずに"
  "身の毛もよだつ"
  "光の速さで"
  "ギリギリセーフ"
  "プログレッシヴ"
  "独り寂しく"
  "涙こらえて"
  "ブログの更新"
  "ゲームづくりは"
  "スマフォアプリが"
]

shimo = [
  "進捗会"
  "プログレス"
  "一人酒"
  "意味不明"
  "家路かな"
  "チラリズム"
  "チョコレート"
  "OS X"
  "Windows"
  "俺 SUGEEE"
  "日曜日"
  "摩天楼"
  "ほめ殺し"
  "風まかせ"
  "夢見がち"
  "ナンバーワン"
  "紙一重"
  "鍋奉行"
  "流れ星"
  "グローバル"
  "表面積"
  "ローグライク"
  "少なすぎ？"
  "溢れ出す"
]
